primer_proyecto/app/Controllers/usuario_controller.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('pedro', 'zalazar', 'zala', 'zala@gmail.com', '$2y$10$UeePT8OhQ6U.wYMF/XpXueM5DaAJD1Xi5WAROrCnRlfqJn/9V6tpS')
---
                echo view('front/footer_view');
            } else {
                // El usuario no existe, guárdalo en la base de datos
                $formModel->save([
                    'nombre' => $this->request->getVar('nombre'),
                    'apellido' => $this->request->getVar('apellido'),
                    'usuario' => $this->request->getVar('usuario'),
                    'email' => $this->request->getVar('email'),
                    'pass' => password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT)
                ]);